### Series

In [5]:
import numpy as np
import pandas as pd

In [6]:
a=[1,2,4,5]
b=np.arange(4)
c={'a':10,'b':34,'c':21,'d':32}
d=['a','b','c','d']

In [7]:
pd.Series(a)

0    1
1    2
2    4
3    5
dtype: int64

In [8]:
e=pd.Series(a, d)
e

a    1
b    2
c    4
d    5
dtype: int64

In [10]:
e['a']

1

In [7]:
pd.Series(c)

a    10
b    34
c    21
d    32
dtype: int64

### DataFrames

In [11]:
 from numpy.random import randn

In [12]:
np.random.seed(101)

In [17]:
df= pd.DataFrame(randn(5,5),['a','b','c','d','e'], ['A','B','C','D','E'])
df

          A         B         C         D         E
a  0.484752 -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366  1.025984
c -0.156598 -0.031579  0.649826  2.154846 -0.610259
d -0.755325 -0.346419  0.147027 -0.479448  0.558769
e  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [22]:
df[['A','B']]

          A         B
a  0.484752 -0.116773
b -0.993263  0.196800
c -0.156598 -0.031579
d -0.755325 -0.346419
e  1.024810 -0.925874

In [24]:
df

          A         B         C         D         E
a  0.484752 -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366  1.025984
c -0.156598 -0.031579  0.649826  2.154846 -0.610259
d -0.755325 -0.346419  0.147027 -0.479448  0.558769
e  1.024810 -0.925874  1.862864 -1.133817  0.610478

#### Column wise selection

### Axis =0 (row wise)
### Axis=1 (Column wise)

In [26]:
df.drop('E', axis=1, inplace= True)
df

          A         B         C         D
a  0.484752 -0.116773  1.901755  0.238127
b -0.993263  0.196800 -1.136645  0.000366
c -0.156598 -0.031579  0.649826  2.154846
d -0.755325 -0.346419  0.147027 -0.479448
e  1.024810 -0.925874  1.862864 -1.133817

In [ ]:
df.drop('e', axis=0, inplace= True)

In [30]:
df

          A         B         C         D
a  0.484752 -0.116773  1.901755  0.238127
b -0.993263  0.196800 -1.136645  0.000366
c -0.156598 -0.031579  0.649826  2.154846
d -0.755325 -0.346419  0.147027 -0.479448

#### Row-wise selection

In [31]:
df.loc['a']

A    0.484752
B   -0.116773
C    1.901755
D    0.238127
Name: a, dtype: float64

In [32]:
df.iloc[0]

A    0.484752
B   -0.116773
C    1.901755
D    0.238127
Name: a, dtype: float64

In [34]:
df.loc['a', 'A']

0.48475164718163294

In [36]:
df

          A         B         C         D
a  0.484752 -0.116773  1.901755  0.238127
b -0.993263  0.196800 -1.136645  0.000366
c -0.156598 -0.031579  0.649826  2.154846
d -0.755325 -0.346419  0.147027 -0.479448

In [39]:
df.loc[['a', 'b'] ,['A','B']]

          A         B
a  0.484752 -0.116773
b -0.993263  0.196800

#### Conditional selection

In [9]:
import pandas as pd
import numpy as np
from numpy.random import randn

df= pd.DataFrame(randn(5,5),['a','b','c','d','e'], ['A','B','C','D','E'])
df

          A         B         C         D         E
a  1.068228  0.174797 -1.361848 -0.066054 -0.874993
b -0.983616  0.473125 -1.328644 -1.034233 -0.282095
c -1.382351 -0.754680 -1.558237 -0.294500 -1.766400
d -0.493849  1.033463 -0.975744  0.188420  0.789388
e -0.365739  0.345863  2.398097 -0.778957  0.022531

This will get the rows where the condition matches

In [11]:
df[df['A']>1]

          A         B         C         D         E
a  1.068228  0.174797 -1.361848 -0.066054 -0.874993

In [20]:
df[(df["A"]>1) & (df["B"]>0.1)][['A','B']]

          A         B
a  1.068228  0.174797

#### To reset index as column

In [21]:
df.reset_index() # inplace=true

  index         A         B         C         D         E
0     a  1.068228  0.174797 -1.361848 -0.066054 -0.874993
1     b -0.983616  0.473125 -1.328644 -1.034233 -0.282095
2     c -1.382351 -0.754680 -1.558237 -0.294500 -1.766400
3     d -0.493849  1.033463 -0.975744  0.188420  0.789388
4     e -0.365739  0.345863  2.398097 -0.778957  0.022531

In [23]:
df.set_index('A')

                  B         C         D         E
A
 1.068228  0.174797 -1.361848 -0.066054 -0.874993
-0.983616  0.473125 -1.328644 -1.034233 -0.282095
-1.382351 -0.754680 -1.558237 -0.294500 -1.766400
-0.493849  1.033463 -0.975744  0.188420  0.789388
-0.365739  0.345863  2.398097 -0.778957  0.022531

### Multi-index

In [35]:
outside= ['G1','G1','G1','G2','G2','G2']
inside= [1,2,3,1,2,3]
hier_index= list(zip(outside, inside))
hier_index= pd.MultiIndex.from_tuples(hier_index)

In [36]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [37]:
randn(6,2)

array([[-0.65954698, -1.17854675],
       [ 0.33664488,  1.43100035],
       [ 0.28879554, -0.24877043],
       [ 1.71525873, -1.03658674],
       [-0.79163462, -2.38741906],
       [-0.5553023 , -1.25730001]])

In [38]:
# randn(6,2) is an array
# A and B are feature names
df= pd.DataFrame(randn(6,2), hier_index,['A','B'])
df

             A         B
G1 1 -0.082603 -0.300217
   2 -0.876775  0.102511
   3  0.111710  0.428288
G2 1  1.627096  0.564615
   2  0.577904  0.650975
   3 -0.443177  1.633188

In [41]:
df.loc['G1']

          A         B
1 -0.082603 -0.300217
2 -0.876775  0.102511
3  0.111710  0.428288

In [40]:
df.loc['G1']['B']

1   -0.300217
2    0.102511
3    0.428288
Name: B, dtype: float64

In [42]:
df.index.names=['groups', 'num']

In [43]:
df.xs('G1')

            A         B
num
1   -0.082603 -0.300217
2   -0.876775  0.102511
3    0.111710  0.428288

In [45]:
#arguments
# 1: The value from each sub section which you wnat to select
# level is the column from whcih we compare to select
df.xs(1, level='num')

               A         B
groups
G1     -0.082603 -0.300217
G2      1.627096  0.564615

### Missing Data

In [1]:
import pandas as pd
import numpy as np

d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,4]}

df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  4

This will drop the entire row when there is nan in it

In [2]:
df.dropna()

     A    B  C
0  1.0  5.0  1

This will drop the column

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  4

Now setting the threshold to 2, meaning that if there are alteast two non nan value then the row should not be drop

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.fillna(value='Filled val')

            A           B  C
0         1.0         5.0  1
1         2.0  Filled val  2
2  Filled val  Filled val  4

In [9]:
df['A'].fillna(value= df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [10]:
import pandas as pd
import numpy as np

In [11]:
data= {'Company':['GOOG', 'GOOG', 'MSFT',  'MSFT', 'FB', 'FB'],
      'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200,120,340,124,243,350]
      }

In [13]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [17]:
companies= df.groupby('Company').sum()
companies

C:\Users\user\AppData\Local\Temp\ipykernel_13288\3001729222.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  companies= df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [19]:
companies[companies['Sales']>400]

         Sales
Company
FB         593
MSFT       464